app/views/physicians/show.html.erb

    <tr>
      <% @physician.offices.each do |office| %>
---
SELECT "offices".* FROM "offices" WHERE "offices"."physician_id" = ?  [["physician_id", 1]]