app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("visit", "physician_id", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visit", "10/28/2019 10:00AM"], ["physician_id", 1], ["patient_id", 1], ["created_at", "2019-10-29 03:22:09.736514"], ["updated_at", "2019-10-29 03:22:09.736514"]]

    def set_appointment
      @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]