app/controllers/physicians_controller.rb

SELECT "physicians".* FROM "physicians"
---
  def index
    @physicians = Physician.all

INSERT INTO "physicians" ("name", "specialty", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dr. Martinez"], ["specialty", "CIS"], ["created_at", "2019-10-29 03:21:33.824436"], ["updated_at", "2019-10-29 03:21:33.824436"]]
---
  def create
    @physician = Physician.new(physician_params)

    respond_to do |format|
      if @physician.save

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_physician
      @physician = Physician.find(params[:id])