app/views/appointments/_form.html.erb

SELECT "physicians".* FROM "physicians"
---
    <%= form.label :physician_id %>
    <%= form.collection_select :physician_id, Physician.all, :id, :name %>

SELECT "patients".* FROM "patients"
---
    <%= form.label :patient_id %>
    <%= form.collection_select :patient_id, Patient.all, :id, :name %>